witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 100, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 8, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB16 F9
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 7, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB17 F8
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 6, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB18 F7
	{.port = 1, .channel = 2, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 5, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB19 F6

	{.port = 1, .channel = 3, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 4, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB23 F5
	{.port = 1, .channel = 3, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 3, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB24 F4
	{.port = 1, .channel = 3, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 2, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB20 F3
	{.port = 1, .channel = 3, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 1, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH}, // SB21 F2

	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 250, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = BUTTONHANDLER_MENU, .holdHandler = BUTTONHANDLER_MENUHOLD},	  // SB22 MENU
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 250, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = BUTTONHANDLER_TUNE, .holdHandler = BUTTONHANDLER_TUNE},		  // SB13 TUNE ATU
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = BUTTONHANDLER_MUTE, .holdHandler = BUTTONHANDLER_MUTE_AFAMP}, // SB14 MUTE
	{.port = 1, .channel = 4, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = BUTTONHANDLER_FUNC, .holdHandler = BUTTONHANDLER_FUNCH},	  // SB15 F1

	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_10m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB2 10M
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_CB, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},	 // SB3 CB
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_2m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},	 // SB4 2M
	{.port = 1, .channel = 5, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_FM, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},	 // SB5 FM

	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_20m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB6 20M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_17m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB7 17M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_15m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB11 15M
	{.port = 1, .channel = 6, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 700, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_12m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB12 12M

	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 117, .tres_max = 231, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_160m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY}, // SB8 160M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 231, .tres_max = 354, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_80m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},  // SB9 80M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 354, .tres_max = 492, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_40m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},  // SB10 40M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 492, .tres_max = 650, .state = false, .prev_state = false, .work_in_menu = true, .parameter = BANDID_30m, .clickHandler = BUTTONHANDLER_GET_BAND_MEMORY, .holdHandler = BUTTONHANDLER_SET_BAND_MEMORY},  // SB1 30M
	{.port = 1, .channel = 7, .type = FUNIT_CTRL_BUTTON, .tres_min = 650, .tres_max = 750, .state = false, .prev_state = false, .work_in_menu = true, .parameter = 0, .clickHandler = FRONTPANEL_ENC2SW_click_handler, .holdHandler = FRONTPANEL_ENC2SW_hold_handler},								  // ENC2_SW
};

const PERIPH_FrontPanel_FuncButton PERIPH_FrontPanel_FuncButtonsList[FUNCBUTTONS_COUNT] = {
	{.name = "A / B", .work_in_menu = false, .clickHandler = BUTTONHANDLER_AsB, .holdHandler = BUTTONHANDLER_AsB},
	{.name = "B=A", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ArB, .holdHandler = BUTTONHANDLER_ArB},
	{.name = "WPM", .work_in_menu = true, .clickHandler = BUTTONHANDLER_WPM, .holdHandler = BUTTONHANDLER_WPM},
	{.name = "POWER", .work_in_menu = true, .clickHandler = BUTTONHANDLER_RF_POWER, .holdHandler = BUTTONHANDLER_RF_POWER},
	{.name = "ANT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ANT, .holdHandler = BUTTONHANDLER_ANT},
	{.name = "RIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_RIT, .holdHandler = BUTTONHANDLER_RIT},
	{.name = "PLAY", .work_in_menu = false, .clickHandler = BUTTONHANDLER_PLAY, .holdHandler = BUTTONHANDLER_FILEMANAGER},
	{.name = "REC", .work_in_menu = false, .clickHandler = BUTTONHANDLER_REC, .holdHandler = BUTTONHANDLER_REC},
	{.name = "SERVICE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SERVICES, .holdHandler = BUTTONHANDLER_SERVICES},

	{.name = "SAMPL-", .work_in_menu = true, .clickHandler = BUTTONHANDLER_SAMPLE_N, .holdHandler = BUTTONHANDLER_SAMPLE_N},
	{.name = "SAMPL+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SAMPLE_P, .holdHandler = BUTTONHANDLER_SAMPLE_P},
	{.name = "ZOOM-", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_N, .holdHandler = BUTTONHANDLER_ZOOM_N},
	{.name = "ZOOM+", .work_in_menu = false, .clickHandler = BUTTONHANDLER_ZOOM_P, .holdHandler = BUTTONHANDLER_ZOOM_P},
	{.name = "XIT", .work_in_menu = true, .clickHandler = BUTTONHANDLER_XIT, .holdHandler = BUTTONHANDLER_XIT},
	{.name = "SPLIT", .work_in_menu = false, .clickHandler = BUTTONHANDLER_SPLIT, .holdHandler = BUTTONHANDLER_SPLIT},
	{.name = "DOUBLE", .work_in_menu = false, .clickHandler = BUTTONHANDLER_DOUBLE, .holdHandler = BUTTONHANDLER_DOUBLEMODE},
	{.name = "HPF", .work_in_menu = true, .clickHandler = BUTTONHANDLER_HPF, .holdHandler = BUTTONHANDLER_HPF},
	{.name = "TUNE", .work_in_menu = true, .clickHandler = BUTTONHANDLER_TUNE, .holdHandler = BUTTONHANDLER_TUNE},

