witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
		char sbuff[32] = {0};
		sprintf(sbuff, "Power: %u", TRX.RF_Power);
		LCD_showTooltip(sbuff);

		return;
	}

	float64_t newfreq = CurrentVFO->Freq;
	if (TRX.ChannelMode && getBandFromFreq(CurrentVFO->Freq, false) != -1 && BANDS[getBandFromFreq(CurrentVFO->Freq, false)].channelsCount > 0)
	{
		int_fast8_t band = getBandFromFreq(CurrentVFO->Freq, false);
		int_fast16_t channel = getChannelbyFreq(CurrentVFO->Freq, false);
		int_fast16_t new_channel = channel + direction;
		if (new_channel < 0)
			new_channel = BANDS[band].channelsCount - 1;
		if (new_channel >= BANDS[band].channelsCount)
			new_channel = 0;

		newfreq = BANDS[band].channels[new_channel].rxFreq;
		TRX.SPLIT_Enabled = (BANDS[band].channels[new_channel].rxFreq != BANDS[band].channels[new_channel].txFreq);
		if (TRX.SPLIT_Enabled)
			TRX_setFrequency(BANDS[band].channels[new_channel].txFreq, SecondaryVFO);
		LCD_UpdateQuery.FreqInfoRedraw = true;
		LCD_UpdateQuery.StatusInfoGUI = true;
		LCD_UpdateQuery.StatusInfoBarRedraw = true;
	}
	else if (TRX.Fast)
	{
		float64_t step = TRX.FRQ_FAST_STEP;
		if (CurrentVFO->Mode == TRX_MODE_CW)
			step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
		if(step < 1.0f) step = 1.0f;

		if (direction == -1.0f)
			newfreq = ceill(newfreq / step) * step;
		if (direction == 1.0f)
			newfreq = floorl(newfreq / step) * step;
		newfreq = newfreq + step * direction;
	}
	else
	{
		float64_t step = TRX.FRQ_STEP;
		if (CurrentVFO->Mode == TRX_MODE_CW)
			step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
		if(step < 1.0f) step = 1.0f;

		if (direction == -1.0f)
			newfreq = ceill(newfreq / step) * step;
		if (direction == 1.0f)
			newfreq = floorl(newfreq / step) * step;
		newfreq = newfreq + step * direction;
	}
	TRX_setFrequency(newfreq, CurrentVFO);
	LCD_UpdateQuery.FreqInfo = true;
	NeedSaveSettings = true;
}

static void FRONTPANEL_ENCODER2_Rotated(int8_t direction) // rotated encoder, handler here, direction -1 - left, 1 - right
{
	TRX_Inactive_Time = 0;
	if (TRX.Locked || LCD_window.opened)
		return;

	if (LCD_systemMenuOpened)
	{
		SYSMENU_eventSecRotateSystemMenu(direction);
		return;
	}

	if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM && CurrentVFO->Mode != TRX_MODE_CW) // no WPM if not CW
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT && ((!TRX.RIT_Enabled && !TRX.XIT_Enabled) || !TRX.FineRITTune)) // nothing to RIT tune
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH && !CurrentVFO->ManualNotchFilter) // nothing to NOTCH tune
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF && CurrentVFO->Mode == TRX_MODE_WFM) // nothing to LPF tune
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF && CurrentVFO->Mode != TRX_MODE_LSB && CurrentVFO->Mode != TRX_MODE_USB) // fast tune HPF in SSB only
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL && !CurrentVFO->SQL) // nothing to SQL tune
		TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;

	if (TRX.ENC2_func_mode == ENC_FUNC_FAST_STEP)
	{
		if(TRX_on_TX) return;
		
		float64_t newfreq = (float64_t)CurrentVFO->Freq;
		float64_t step = 0;
		if (TRX.ChannelMode && getBandFromFreq(CurrentVFO->Freq, false) != -1 && BANDS[getBandFromFreq(CurrentVFO->Freq, false)].channelsCount > 0)
		{
			int_fast8_t band = getBandFromFreq(CurrentVFO->Freq, false);
			int_fast16_t channel = getChannelbyFreq(CurrentVFO->Freq, false);
			int_fast16_t new_channel = channel + direction;
			if (new_channel < 0)
				new_channel = BANDS[band].channelsCount - 1;
			if (new_channel >= BANDS[band].channelsCount)
				new_channel = 0;

			newfreq = BANDS[band].channels[new_channel].rxFreq;
			TRX.SPLIT_Enabled = (BANDS[band].channels[new_channel].rxFreq != BANDS[band].channels[new_channel].txFreq);
			if (TRX.SPLIT_Enabled)
				TRX_setFrequency(BANDS[band].channels[new_channel].txFreq, SecondaryVFO);
			LCD_UpdateQuery.FreqInfoRedraw = true;
			LCD_UpdateQuery.StatusInfoGUI = true;
			LCD_UpdateQuery.StatusInfoBarRedraw = true;
		}
		else if (TRX.Fast)
		{
			step = TRX.FRQ_ENC_FAST_STEP;
			if (CurrentVFO->Mode == TRX_MODE_WFM)
				step = step * 2.0;
			if (CurrentVFO->Mode == TRX_MODE_CW)
				step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
			if(step < 1.0f) step = 1.0f;

			if (direction == -1.0f)
				newfreq = ceill(newfreq / step) * step;
			if (direction == 1.0f)
				newfreq = floorl(newfreq / step) * step;
			newfreq = newfreq + step * direction;
		}
		else
		{
			step = TRX.FRQ_ENC_STEP;
			if (CurrentVFO->Mode == TRX_MODE_WFM)
				step = step * 2.0;
			if (CurrentVFO->Mode == TRX_MODE_CW)
				step = step / (float64_t)TRX.FRQ_CW_STEP_DIVIDER;
			if(step < 1.0f) step = 1.0f;

			if (direction == -1.0f)
				newfreq = ceill(newfreq / step) * step;
			if (direction == 1.0f)
				newfreq = floorl(newfreq / step) * step;
			newfreq = newfreq + step * direction;
		}
		TRX_setFrequency(newfreq, CurrentVFO);
		LCD_UpdateQuery.FreqInfo = true;
	}

	if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM)
	{
		// ENC2 Func mode (WPM)
		TRX.CW_KEYER_WPM += direction;
		if (TRX.CW_KEYER_WPM < 1)
			TRX.CW_KEYER_WPM = 1;
		if (TRX.CW_KEYER_WPM > 200)
			TRX.CW_KEYER_WPM = 200;
		char sbuff[32] = {0};
		sprintf(sbuff, "WPM: %u", TRX.CW_KEYER_WPM);
		LCD_showTooltip(sbuff);
	}

	if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT) // Fine RIT/XIT
	{
		if (TRX.RIT_Enabled && TRX.FineRITTune)
		{
			TRX_RIT += direction * 10;
			if (TRX_RIT > TRX.RIT_INTERVAL)
				TRX_RIT = TRX.RIT_INTERVAL;
			if (TRX_RIT < -TRX.RIT_INTERVAL)
				TRX_RIT = -TRX.RIT_INTERVAL;
		}

		if (TRX.XIT_Enabled && TRX.FineRITTune)
		{
			TRX_XIT += direction * 10;
			if (TRX_XIT > TRX.XIT_INTERVAL)
				TRX_XIT = TRX.XIT_INTERVAL;
			if (TRX_XIT < -TRX.XIT_INTERVAL)
				TRX_XIT = -TRX.XIT_INTERVAL;
		}
	}

	if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH) // Manual Notch
	{
		float64_t step = 50;
		if (CurrentVFO->Mode == TRX_MODE_CW)
			step = 10;
		if (CurrentVFO->ManualNotchFilter)
		{
			if (CurrentVFO->NotchFC > step && direction < 0)
				CurrentVFO->NotchFC -= step;
			else if (CurrentVFO->NotchFC < CurrentVFO->LPF_RX_Filter_Width && direction > 0)
				CurrentVFO->NotchFC += step;

			CurrentVFO->NotchFC = roundf((float64_t)CurrentVFO->NotchFC / step) * step;

