witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
			if (CurrentVFO->NotchFC < step)
				CurrentVFO->NotchFC = step;

			if (CurrentVFO->NotchFC > CurrentVFO->LPF_RX_Filter_Width)
				CurrentVFO->NotchFC = CurrentVFO->LPF_RX_Filter_Width;

			LCD_UpdateQuery.StatusInfoGUI = true;
			NeedReinitNotch = true;
			NeedWTFRedraw = true;
		}
	}
	
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF) // LPF
	{
		if (!TRX_on_TX) {
			if (CurrentVFO->Mode == TRX_MODE_CW)
				SYSMENU_HANDL_AUDIO_CW_LPF_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY)
				SYSMENU_HANDL_AUDIO_SSB_LPF_RX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM)
				SYSMENU_HANDL_AUDIO_AM_LPF_RX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_NFM)
				SYSMENU_HANDL_AUDIO_FM_LPF_RX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_DIGI_L)
				SYSMENU_HANDL_AUDIO_DIGI_LPF_pass(direction);
		} else {
			if (CurrentVFO->Mode == TRX_MODE_CW)
				SYSMENU_HANDL_AUDIO_CW_LPF_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY)
				SYSMENU_HANDL_AUDIO_SSB_LPF_TX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM)
				SYSMENU_HANDL_AUDIO_AM_LPF_TX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_NFM)
				SYSMENU_HANDL_AUDIO_FM_LPF_TX_pass(direction);
			if (CurrentVFO->Mode == TRX_MODE_DIGI_L)
				SYSMENU_HANDL_AUDIO_DIGI_LPF_pass(direction);
		}
	}
	
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF) // HPF
	{
		if (!TRX_on_TX) {
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY)
				SYSMENU_HANDL_AUDIO_SSB_HPF_RX_pass(direction);
		} else {
			if (CurrentVFO->Mode == TRX_MODE_LSB || CurrentVFO->Mode == TRX_MODE_USB || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY)
				SYSMENU_HANDL_AUDIO_SSB_HPF_TX_pass(direction);
		}
	}
	
	if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL) // SQL
	{
		CurrentVFO->FM_SQL_threshold_dbm += direction * 1;
		TRX.FM_SQL_threshold_dbm_shadow = CurrentVFO->FM_SQL_threshold_dbm;
		
		if(CurrentVFO->FM_SQL_threshold_dbm > 0)
			CurrentVFO->FM_SQL_threshold_dbm = 0;
		if(CurrentVFO->FM_SQL_threshold_dbm < -126)
			CurrentVFO->FM_SQL_threshold_dbm = -126;
		
		LCD_UpdateQuery.StatusInfoBarRedraw = true;
	}
}

void FRONTPANEL_check_ENC2SW(bool state)
{
// check touchpad events
#ifdef HAS_TOUCHPAD
	return;
#endif

	static uint32_t menu_enc2_click_starttime = 0;
	static bool ENC2SW_Last = true;
	static bool ENC2SW_clicked = false;
	static bool ENC2SW_hold_start = false;
	static bool ENC2SW_holded = false;
	ENC2SW_clicked = false;
	ENC2SW_holded = false;

	if (TRX.Locked)
		return;

	bool ENC2SW_AND_TOUCH_Now = HAL_GPIO_ReadPin(ENC2SW_AND_TOUCHPAD_GPIO_Port, ENC2SW_AND_TOUCHPAD_Pin);
	// check hold and click
	if (ENC2SW_Last != ENC2SW_AND_TOUCH_Now)
	{
		ENC2SW_Last = ENC2SW_AND_TOUCH_Now;
		if (!ENC2SW_AND_TOUCH_Now)
		{
			menu_enc2_click_starttime = HAL_GetTick();
			ENC2SW_hold_start = true;
		}
	}
	if (!ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > KEY_HOLD_TIME)
		{
			ENC2SW_holded = true;
			ENC2SW_hold_start = false;
		}
	}
	if (ENC2SW_AND_TOUCH_Now && ENC2SW_hold_start)
	{
		if ((HAL_GetTick() - menu_enc2_click_starttime) > 1)
		{
			ENC2SW_clicked = true;
			ENC2SW_hold_start = false;
		}
	}

	// ENC2 Button hold
	if (ENC2SW_holded)
	{
		FRONTPANEL_ENC2SW_hold_handler(0);
	}

	// ENC2 Button click
	if (ENC2SW_clicked)
	{
		menu_enc2_click_starttime = HAL_GetTick();
		FRONTPANEL_ENC2SW_click_handler(0);
	}
}

static void FRONTPANEL_ENC2SW_click_handler(uint32_t parameter)
{
	TRX_Inactive_Time = 0;
	// ENC2 CLICK
	if (!LCD_systemMenuOpened && !LCD_window.opened)
	{
		TRX.ENC2_func_mode++; // enc2 rotary mode

		if (TRX.ENC2_func_mode == ENC_FUNC_PAGER) // pager disabled
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM && CurrentVFO->Mode != TRX_MODE_CW) // no WPM if not CW
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT && ((!TRX.RIT_Enabled && !TRX.XIT_Enabled) || !TRX.FineRITTune)) // nothing to RIT tune
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH && !CurrentVFO->ManualNotchFilter) // nothing to NOTCH tune
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF && CurrentVFO->Mode == TRX_MODE_WFM) // nothing to LPF tune
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF && CurrentVFO->Mode != TRX_MODE_LSB && CurrentVFO->Mode != TRX_MODE_USB) // fast tune HPF in SSB only
			TRX.ENC2_func_mode++;
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL && !CurrentVFO->SQL) // nothing to SQL tune
			TRX.ENC2_func_mode++;

		if (TRX.ENC2_func_mode >= ENC_FUNC_SET_VOLUME)
			TRX.ENC2_func_mode = ENC_FUNC_FAST_STEP;
		
		if (TRX.ENC2_func_mode == ENC_FUNC_FAST_STEP)
			LCD_showTooltip("FAST STEP");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_WPM)
			LCD_showTooltip("SET WPM");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_RIT)
			LCD_showTooltip("SET RIT");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_NOTCH)
			LCD_showTooltip("SET NOTCH");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_LPF)
			LCD_showTooltip("SET LPF");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_HPF)
			LCD_showTooltip("SET HPF");
		if (TRX.ENC2_func_mode == ENC_FUNC_SET_SQL)
			LCD_showTooltip("SET SQL");
	}
	else
	{
		if (LCD_systemMenuOpened)
		{
			// navigate in menu
			SYSMENU_eventSecEncoderClickSystemMenu();
		}
	}
}

static void FRONTPANEL_ENC2SW_hold_handler(uint32_t parameter)
{
	TRX_Inactive_Time = 0;
	BUTTONHANDLER_MENU(0);
}

void FRONTPANEL_Init(void)
{
	uint16_t test_value = 0;
#ifdef HRDW_MCP3008_1
	test_value = FRONTPANEL_ReadMCP3008_Value(0, 1);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_1_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 1 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 1 init error (FPGA I2S CLK?)", true);
	}
#endif
#ifdef HRDW_MCP3008_2
	test_value = FRONTPANEL_ReadMCP3008_Value(0, 2);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_2_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 2 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 2 init error", true);
	}
#endif
#ifdef HRDW_MCP3008_3
	test_value = FRONTPANEL_ReadMCP3008_Value(0, 3);
	if (test_value == 65535)
	{
		FRONTPanel_MCP3008_3_Enabled = false;
		println("[ERR] Frontpanel MCP3008 - 3 not found, disabling... (FPGA SPI/I2S CLOCK ERROR?)");
		LCD_showError("MCP3008 - 3 init error", true);
	}
#endif
	FRONTPANEL_Process();
}

void FRONTPANEL_Process(void)
{
	if (LCD_systemMenuOpened && !LCD_busy && FRONTPANEL_ProcessEncoder1 != 0)
	{
		SYSMENU_eventRotateSystemMenu(FRONTPANEL_ProcessEncoder1);
		FRONTPANEL_ProcessEncoder1 = 0;
	}

	if (FRONTPANEL_ProcessEncoder2 != 0)
	{
		FRONTPANEL_ENCODER2_Rotated(FRONTPANEL_ProcessEncoder2);
		FRONTPANEL_ProcessEncoder2 = 0;
	}

#ifndef HAS_TOUCHPAD
	FRONTPANEL_check_ENC2SW(true);
#endif

	if (SD_USBCardReader)
		return;
	if (HRDW_SPI_Locked)
		return;
	HRDW_SPI_Locked = true;

