witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
	static uint32_t fu_debug_lasttime = 0;
	uint16_t buttons_count = sizeof(PERIPH_FrontPanel_Buttons) / sizeof(PERIPH_FrontPanel_Button);
	uint16_t mcp3008_value = 0;

	// process buttons
	for (uint16_t b = 0; b < buttons_count; b++)
	{
		PERIPH_FrontPanel_Button *button = &PERIPH_FrontPanel_Buttons[b];
// check disabled ports
#ifdef HRDW_MCP3008_1
		if (button->port == 1 && !FRONTPanel_MCP3008_1_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_2
		if (button->port == 2 && !FRONTPanel_MCP3008_2_Enabled)
			continue;
#endif
#ifdef HRDW_MCP3008_3
		if (button->port == 3 && !FRONTPanel_MCP3008_3_Enabled)
			continue;
#endif

// get state from ADC MCP3008 (10bit - 1024values)
#ifdef HRDW_MCP3008_1
		if (button->port == 1)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, 1);
		else
#endif
#ifdef HRDW_MCP3008_2
			if (button->port == 2)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, 2);
		else
#endif
#ifdef HRDW_MCP3008_3
			if (button->port == 3)
			mcp3008_value = FRONTPANEL_ReadMCP3008_Value(button->channel, 3);
		else
#endif
			continue;

		if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
		{
			static uint8_t fu_gebug_lastchannel = 255;
			if ((HAL_GetTick() - fu_debug_lasttime > 500 && fu_gebug_lastchannel != button->channel) || fu_debug_lasttime == 0)
			{
				println("F_UNIT: port ", button->port, " channel ", button->channel, " value ", mcp3008_value);
				fu_gebug_lastchannel = button->channel;
			}
		}

		// TANGENT
		if (button->type == FUNIT_CTRL_TANGENT)
		{
			// Yaesu MH-36
			if (CALIBRATE.TangentType == TANGENT_MH36)
				for (uint16_t tb = 0; tb < (sizeof(PERIPH_FrontPanel_TANGENT_MH36) / sizeof(PERIPH_FrontPanel_Button)); tb++)
					if (button->channel == PERIPH_FrontPanel_TANGENT_MH36[tb].channel)
						FRONTPANEL_CheckButton(&PERIPH_FrontPanel_TANGENT_MH36[tb], mcp3008_value);

			// Yaesu MH-48
			if (CALIBRATE.TangentType == TANGENT_MH48)
				for (uint16_t tb = 0; tb < (sizeof(PERIPH_FrontPanel_TANGENT_MH48) / sizeof(PERIPH_FrontPanel_Button)); tb++)
					if (button->channel == PERIPH_FrontPanel_TANGENT_MH48[tb].channel)
						FRONTPANEL_CheckButton(&PERIPH_FrontPanel_TANGENT_MH48[tb], mcp3008_value);
		}
		else
			FRONTPANEL_CheckButton(button, mcp3008_value); // other buttons / resistors
	}

	if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
	{
		if (HAL_GetTick() - fu_debug_lasttime > 500)
		{
			println("");
			fu_debug_lasttime = HAL_GetTick();
		}
	}

	HRDW_SPI_Locked = false;
}

void FRONTPANEL_CheckButton(PERIPH_FrontPanel_Button *button, uint16_t mcp3008_value)
{
	// AF_GAIN
	if (button->type == FUNIT_CTRL_AF_GAIN)
	{
		static float32_t AF_VOLUME_mcp3008_averaged = 0.0f;
		AF_VOLUME_mcp3008_averaged = AF_VOLUME_mcp3008_averaged * 0.6f + mcp3008_value * 0.4f;
		
		TRX.Volume = (uint16_t)(MAX_VOLUME_VALUE - AF_VOLUME_mcp3008_averaged);
		if (TRX.Volume < 50)
			TRX.Volume = 0;
	}

	// RIT / XIT or IF Gain
	if (button->type == FUNIT_CTRL_RIT_XIT)
	{
		static float32_t IF_GAIN_mcp3008_averaged = 0.0f;
		IF_GAIN_mcp3008_averaged = IF_GAIN_mcp3008_averaged * 0.6f + mcp3008_value * 0.4f;
		
		if (TRX.RIT_Enabled)
		{
			static int_fast16_t TRX_RIT_old = 0;
			if (!TRX.FineRITTune)
				TRX_RIT = (int_fast16_t)(((1023.0f - IF_GAIN_mcp3008_averaged) * TRX.RIT_INTERVAL * 2 / 1023.0f) - TRX.RIT_INTERVAL);

			if (TRX_RIT_old != TRX_RIT)
			{
				TRX_RIT_old = TRX_RIT;
				TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
				uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
				LCD_bw_trapez_stripe_pos_new += (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_RIT / (float32_t)TRX.RIT_INTERVAL));
				if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
				{
					LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
					LCD_UpdateQuery.StatusInfoGUI = true;
				}
			}
			TRX_XIT = 0;
		}

		if (TRX.XIT_Enabled)
		{
			static int_fast16_t TRX_XIT_old = 0;
			if (!TRX.FineRITTune)
				TRX_XIT = (int_fast16_t)(((1023.0f - IF_GAIN_mcp3008_averaged) * TRX.XIT_INTERVAL * 2 / 1023.0f) - TRX.XIT_INTERVAL);

			if (TRX_XIT_old != TRX_XIT)
			{
				TRX_XIT_old = TRX_XIT;
				TRX_setFrequency(CurrentVFO->Freq, CurrentVFO);
				uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
				LCD_bw_trapez_stripe_pos_new += (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_XIT / (float32_t)TRX.XIT_INTERVAL));
				if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
				{
					LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
					LCD_UpdateQuery.StatusInfoGUI = true;
				}
			}
			TRX_RIT = 0;
		}
		
		if (!TRX.RIT_Enabled && TRX.XIT_Enabled && !TRX.FineRITTune) // Disable RIT/XIT + IF
		{
			TRX_RIT = 0;
			TRX_XIT = 0;
			TRX.IF_Gain = (uint8_t)(0.0f + ((1023.0f - IF_GAIN_mcp3008_averaged) * 60.0f / 1023.0f));
		}

		if (TRX.FineRITTune) // IF only
		{
			TRX.IF_Gain = (uint8_t)(0.0f + ((1023.0f - IF_GAIN_mcp3008_averaged) * 60.0f / 1023.0f));
		}
	}

	// PTT
	if (button->type == FUNIT_CTRL_PTT)
	{
		static bool frontunit_ptt_state_prev = false;
		bool frontunit_ptt_state_now = false;
		if (mcp3008_value > button->tres_min && mcp3008_value < button->tres_max)
			frontunit_ptt_state_now = true;
		if (frontunit_ptt_state_prev != frontunit_ptt_state_now)
		{
			TRX_ptt_soft = frontunit_ptt_state_now;
			TRX_ptt_change();
			frontunit_ptt_state_prev = frontunit_ptt_state_now;
		}
	}

	// BUTTONS
	if (button->type == FUNIT_CTRL_BUTTON)
	{
		// set state
		if (mcp3008_value >= button->tres_min && mcp3008_value < button->tres_max)
		{
			TRX_Inactive_Time = 0;
			button->state = true;
			if (TRX.Debug_Type == TRX_DEBUG_BUTTONS)
				println("Button pressed: port ", button->port, " channel ", button->channel, " value: ", mcp3008_value);
		}
		else
			button->state = false;

		// check state
		if ((button->prev_state != button->state) && button->state)
		{
			button->start_hold_time = HAL_GetTick();
			button->afterhold = false;
		}

