witalis3/UA3REO-DDC-Transceiver/STM32/WOLF/Src/front_unit.c
		// check hold state
		if ((button->prev_state == button->state) && button->state && ((HAL_GetTick() - button->start_hold_time) > KEY_HOLD_TIME) && !button->afterhold)
		{
			button->afterhold = true;
			if (!LCD_systemMenuOpened || button->work_in_menu)
			{
				if (!LCD_window.opened)
				{
					if (button->holdHandler != NULL)
					{
						CODEC_Beep();
						button->holdHandler(button->parameter);
					}
				}
				else
				{
					LCD_closeWindow();
				}
			}
		}

		// check click state
		if ((button->prev_state != button->state) && !button->state && ((HAL_GetTick() - button->start_hold_time) < KEY_HOLD_TIME) && !button->afterhold && !TRX.Locked)
		{
			if (!LCD_systemMenuOpened || button->work_in_menu)
			{
				if (!LCD_window.opened)
				{
					if (button->clickHandler != NULL)
					{
						CODEC_Beep();
						button->clickHandler(button->parameter);
					}
				}
				else
				{
					LCD_closeWindow();
				}
			}
		}

		// save prev state
		button->prev_state = button->state;
	}

	// DEBUG BUTTONS
	if (button->type == FUNIT_CTRL_BUTTON_DEBUG)
	{
		char str[64] = {0};
		sprintf(str, "%d: %d       ", button->channel, mcp3008_value);
		LCDDriver_printText(str, 10, 200 + button->channel * 20, COLOR_RED, BG_COLOR, 2);
	}
}

static uint16_t FRONTPANEL_ReadMCP3008_Value(uint8_t channel, uint8_t adc_num)
{
	uint8_t outData[3] = {0};
	uint8_t inData[3] = {0};
	uint16_t mcp3008_value = 0;

	outData[0] = 0x18 | channel;
	bool res = false;
	if(adc_num == 1) res = HRDW_FrontUnit_SPI(outData, inData, 3, false);
	if(adc_num == 2) res = HRDW_FrontUnit2_SPI(outData, inData, 3, false);
	if(adc_num == 3) res = HRDW_FrontUnit3_SPI(outData, inData, 3, false);
	if (res == false)
		return 65535;
	mcp3008_value = (uint16_t)(0 | ((inData[1] & 0x3F) << 4) | (inData[2] & 0xF0 >> 4));

	return mcp3008_value;
}
